{
    "SIMPLE_COVER_5E": {
        "Settings": {
            "CoverScope": {
                "Name": "Geltungsbereich für das Entfernen von Deckung",
                "Hint": "Wähle, welche Figuren betroffen sind, wenn Deckung entfernt wird: alle Figur in der Szene, nur Teilnehmer im Kampf oder nur spielereigene Figur.",
                "Options": {
                    "All": "Alle Figuren in der Szene",
                    "Combatants": "Nur Teilnehmer im Kampf",
                    "Player": "Nur spielereigene Figur"
                }
            },
            "OnlyInCombat": {
                "Name": "Deckung nur im Kampf berechnen",
                "Hint": "Wenn aktiviert, wird die automatische Deckung-Berechnung nur durchgeführt, solange eine Kampfbegegnung aktiv ist."
            },
            "RemoveOnCombat": {
                "Name": "Deckung bei Kampfaktualisierungen entfernen",
                "Hint": "Entfernt den Deckungsstatus automatisch bei Änderungen im Kampf (Zug/Runde/Initiative) unter Berücksichtigung des ausgewählten Geltungsbereichs für das Entfernen von Deckung."
            },
            "RemoveOnMove": {
                "Name": "Deckung bei Figur-Bewegung entfernen",
                "Hint": "Entfernt den Deckungsstatus automatisch, wenn sich ein Figur während eines aktiven Kampfes bewegt, unter Berücksichtigung des ausgewählten Geltungsbereichs für das Entfernen von Deckung."
            },
            "losCheck": {
                "Name": "Wand Sichtlinen Prüfung",
                "Hint": "Wenn aktiviert, prüft das Modul auch die Sichtlinie gegen sichtlichen blockierenden Wänden. Dies kann genutzt werden, um Fälle zu erkennen, in denen das Ziel vollständig von Wänden blockiert ist."
            },
            "CreaturesHalfOnly": {
                "Name": "Deckung durch Kreaturen auf Halbe Deckung begrenzen",
                "Hint": "Wenn aktiviert, können Kreaturen maximal Halbe Deckung gewähren. Sobald mindestens eine Linie ausschließlich durch Kreaturen blockiert wird, erhält das Ziel Halbe Deckung, aber niemals Dreiviertel Deckung allein durch Kreaturen. Wände folgen weiterhin den normalen DMG-Regeln."
            },
            "IgnoreAllAOE": {
                "Name": "Deckung bei allen Flächeneffekten ignorieren",
                "Hint": "Überspringt Deckungsprüfungen, sobald die Aktivität irgendeine Flächen-Schablone definiert. Wenn eine Schablone vorhanden ist, wird für diesen Wurf keine Deckung berechnet."
            },
            "IgnoreDistanceAOE": {
                "Name": "Deckung bei Flächeneffekten auf Distanz ignorieren",
                "Hint": "Überspringt Deckungsprüfungen für Aktivitäten, die einen Wirkbereich auf Distanz erzeugen (z. B. Feuerball). Dies gilt, wenn die Aktivität eine Bereich-Schablone und eine Reichweite größer als 1 sowie mit Reichweiteneinheiten ungleich Selbst/Berührung/Spezial verwendet."
            },
            "IgnoreDistanceSpace": {
                "Name": "Deckung bei Zielwahl 'Space' auf Distanz ignorieren",
                "Hint": "Überspringt Deckungsprüfungen, wenn die Aktivität einen Punkt im Raum auf Distanz anvisiert (Reichweite > 1 und Ziel-Typ ist \"space\"). Das wird häufig bei Beschwörungs-Features/-Zaubern verwendet, bei denen der eigentliche Angriff/Effekt von der beschworenen Kreatur ausgeht. Deckung sollte dann von der Beschwörung aus berechnet werden, nicht vom ursprünglichen Feature/Zauber."
            },
            "Hover": {
                "Name": "Hover-Deckung-Anzeige",
                "Hint": "Steuert, ob und wie Deckung-Informationen und Entfernungen beim Hovern einer Figur angezeigt werden.",
                "Options": {
                    "Off": "Deaktiviert",
                    "CoverOnly": "Nur Deckung-Icons",
                    "CoverAndDistance": "Deckung-Icons und Entfernung"
                }
            },
            "HoverLabelPosition": {
                "Name": "Position des Hover-Labels",
                "Hint": "Wähle, wo das Hover-Label relativ zum Ziel-Figur verankert wird.",
                "Options": {
                    "Above": "Über der Figur",
                    "On": "Zentriert auf der Figur",
                    "Below": "Unter der Figur"
                }
            },
            "HoverLabelYOffset": {
                "Name": "Vertikaler Versatz des Hover-Labels",
                "Hint": "Zusätzlicher vertikaler Versatz (in Pixeln), der auf die Position des Hover-Labels angewendet wird. Positive Werte bewegen das Label nach unten, negative nach oben."
            },
            "HoverLabelXOffset": {
                "Name": "Horizontaler Versatz des Hover-Labels",
                "Hint": "Zusätzlicher horizontaler Versatz (in Pixeln), der auf die Position des Hover-Labels angewendet wird. Positive Werte bewegen das Label nach rechts, negative nach links."
            },
            "GridlessDistanceMode": {
                "Name": "Entfernungsmodus auf gitterlosen Szenen",
                "Hint": "Wähle, wie Entfernungen in gitterlosen Szenen gemessen werden: von Zentrum zu Zentrum oder von Kante zu Kante.",
                "Options": {
                    "CenterCenter": "Zentrum zu Zentrum",
                    "EdgeEdge": "Kante zu Kante",
                    "EdgeToCenter": "Quellenkante zu Zielzentrum"
                }
            },
            "GridlessTokenShape": {
                "Name": "Figurform in gitterlosen Szenen",
                "Hint": "Legt fest, ob Figuren in gitterlosen Szenen als Quadrate oder als Kreise (mit mehreren Kreisen für größere Kreaturen) für Distanz- und Deckungsberechnungen behandelt werden.",
                "Options": {
                    "Square": "Quadrate",
                    "Circle": "Kreise"
                }
            },
            "CreaturesProne": {
                "Name": "Anpassung der Körperhöhe bei Liegend",
                "Hint": "Steuert, wie liegende Kreaturen beim Erzeugen ihres 3D-Prismas für Deckungsberechnungen behandelt werden. Wenn das Modul \"Wall Height\" aktiv ist, fällt „Eine Größenkategorie kleiner behandeln“ auf halbe Höhe zurück.",
                "Options": {
                    "None": "Keine Anpassung",
                    "LowerSize": "Eine Größenkategorie kleiner behandeln",
                    "Half": "Nur halb so groß behandeln"
                }
            },
            "Debug": {
                "Name": "Deckung-Debug-Linien anzeigen",
                "Hint": "Zeichnet Hilfslinien während der Deckung-Berechnung zwischen Figuren (zum Debugging/Fehlerbeheben)."
            },
            "CreatureHeights": {
                "Name": "Standard-Kreaturenhöhen",
                "Hint": "Standard-Kreaturenhöhen (in Rastereinheiten) je Größenkategorie, die für die 3D-Deckungsberechnung verwendet werden. Wenn das Modul \"Wall Height\" aktiv ist, werden diese Vorgaben ignoriert und stattdessen die Höhen aus diesem Modul übernommen."
            },
            "insetAttacker": {
                "Name": "Angreifer-Einrückung (px)",
                "Hint": "Verschiebt die Messpunkte des Angreifers von der Roh-Ecke in Richtung Figur-Zentrum (Standard: 1; Max: 30% der aktuellen Rastergröße)."
            },
            "insetTarget": {
                "Name": "Ziel-Einrückung (px)",
                "Hint": "Verschiebt die Messpunkte des Ziels von der Roh-Ecke in Richtung Figur-Zentrum (Standard: 3; Max: 30% der aktuellen Rastergröße)."
            },
            "insetOccluder": {
                "Name": "Verdeckung-Einrückung (px)",
                "Hint": "Verkleinert die Verdeckungsbegrenzungsbox für Kreaturen (Standard: 3; Max: 30% der aktuellen Rastergröße)."
            },
            "HeightsMenu": {
                "Name": "Kreaturenhöhen",
                "Label": "Kreaturenhöhen konfigurieren",
                "Hint": "Passe die Standardhöhen (in Rastereinheiten) für jede Kreaturengröße an, die bei der Deckungsberechnung verwendet werden. Wenn das Modul \"Wall Height\" aktiv ist, werden diese Vorgaben ignoriert und stattdessen die Höhen aus diesem Modul übernommen.",
                "Legend": "Kreaturenhöhen",
                "BodyHint": "Lege die Standardhöhe (in Rastereinheiten) für jede Kreaturengröße fest. Diese Werte werden verwendet, wenn Figuren für Deckung als 3D-Prismen behandelt werden. Wenn das Modul \"Wall Height\" aktiv ist, werden diese Vorgaben ignoriert und stattdessen die Höhen aus diesem Modul übernommen.",
                "Buttons": {
                    "Save": "Speichern",
                    "Reset": "Zurücksetzen"
                }
            },
            "VariantMenu": {
                "Name": "Deckungs- & Messregeln",
                "Label": "Deckungs- & Messregeln konfigurieren",
                "Hint": "Lege fest, wie Simple Cover 5e Deckung berechnet und Entfernungen misst.",
                "Buttons": {
                    "Save": "Speichern"
                },
                "Groups": {
                    "General": "Deckungsregeln",
                    "Measurement": "Messregeln",
                    "Engine": "Engine Regeln"
                }
            }
        },
        "Controls": {
            "ClearCover": {
                "Title": "Deckung-Effekte entfernen"
            }
        }
    }
}