{
    "SIMPLE_COVER_5E": {
        "Settings": {
            "CoverScope": {
                "Name": "Geltungsbereich für das Entfernen von Cover",
                "Hint": "Wähle, welche Token betroffen sind, wenn Cover entfernt wird: alle Token in der Szene, nur Kämpfer im Kampf oder nur spielereigene Token.",
                "Options": {
                    "All": "Alle Token in der Szene",
                    "Combatants": "Nur Kämpfer",
                    "Player": "Nur spielereigene Token"
                }
            },
            "OnlyInCombat": {
                "Name": "Cover nur im Kampf anwenden",
                "Hint": "Wenn aktiviert, wird die automatische Cover-Berechnung nur durchgeführt, solange eine Kampfbegegnung aktiv ist."
            },
            "RemoveOnCombat": {
                "Name": "Cover bei Kampfaktualisierungen entfernen",
                "Hint": "Entfernt die Cover-Bedingung automatisch bei Änderungen im Kampf (Zug/Runde/Initiative) unter Berücksichtigung des ausgewählten Geltungsbereichs für das Entfernen von Cover."
            },
            "RemoveOnMove": {
                "Name": "Cover bei Token-Bewegung entfernen",
                "Hint": "Entfernt die Cover-Bedingung automatisch, wenn sich ein Token während eines aktiven Kampfes bewegt, unter Berücksichtigung des ausgewählten Geltungsbereichs für das Entfernen von Cover."
            },
            "CreaturesHalfOnly": {
                "Name": "Cover durch Kreaturen auf 1/2 Cover begrenzen",
                "Hint": "Wenn aktiviert, können Kreaturen maximal Half Cover gewähren. Sobald mindestens eine Linie ausschließlich durch Kreaturen blockiert wird, erhält das Ziel Half Cover, aber niemals Three-Quarters Cover allein durch Kreaturen. Wände folgen weiterhin den normalen DMG-Regeln."
            },
            "Hover": {
                "Name": "Hover-Cover-Anzeige",
                "Hint": "Steuert, ob und wie Cover-Informationen und Entfernungen beim Hovern eines Tokens angezeigt werden.",
                "Options": {
                    "Off": "Deaktiviert",
                    "CoverOnly": "Nur Cover-Icons",
                    "CoverAndDistance": "Cover-Icons und Entfernung"
                }
            },
            "HoverLabelPosition": {
                "Name": "Position des Hover-Labels",
                "Hint": "Wähle, wo das Hover-Label relativ zum Ziel-Token verankert wird.",
                "Options": {
                    "Above": "Über dem Token",
                    "On": "Zentriert auf dem Token",
                    "Below": "Unter dem Token"
                }
            },
            "HoverLabelYOffset": {
                "Name": "Vertikaler Versatz des Hover-Labels",
                "Hint": "Zusätzlicher vertikaler Versatz (in Pixeln), der auf die Position des Hover-Labels angewendet wird. Positive Werte bewegen das Label nach unten, negative nach oben."
            },
            "HoverLabelXOffset": {
                "Name": "Horizontaler Versatz des Hover-Labels",
                "Hint": "Zusätzlicher horizontaler Versatz (in Pixeln), der auf die Position des Hover-Labels angewendet wird. Positive Werte bewegen das Label nach rechts, negative nach links."
            },
            "GridlessDistanceMode": {
                "Name": "Entfernungsmodus ohne Raster",
                "Hint": "Wähle, wie Entfernungen in rasterlosen Szenen gemessen werden: von Zentrum zu Zentrum oder von Kante zu Kante.",
                "Options": {
                    "CenterCenter": "Zentrum zu Zentrum",
                    "EdgeEdge": "Kante zu Kante",
                    "EdgeToCenter": "Quellenkante zu Zielzentrum"
                }
            },
            "GridlessTokenShape": {
                "Name": "Tokenform in gridlosen Szenen",
                "Hint": "Legt fest, ob Tokens in gridlosen Szenen als Quadrate oder als Kreise (mit mehreren Kreisen für größere Kreaturen) für Distanz- und Deckungsberechnungen behandelt werden.",
                "Options": {
                    "Square": "Quadrate",
                    "Circle": "Kreise"
                }
            },
            "CreaturesProne": {
                "Name": "Anpassung der Körperhöhe bei Liegend",
                "Hint": "Steuert, wie liegende Kreaturen beim Erzeugen ihres 3D-Prismas für Deckungsberechnungen behandelt werden. Wenn das Modul \"Wall Height\" aktiv ist, fällt „Eine Größenkategorie kleiner behandeln“ auf halbe Höhe zurück.",
                "Options": {
                    "None": "Keine Anpassung",
                    "LowerSize": "Eine Größenkategorie kleiner behandeln",
                    "Half": "Nur halb so groß behandeln"
                }
            },
            "Debug": {
                "Name": "Cover-Debug-Linien anzeigen",
                "Hint": "Zeichnet Hilfslinien während der Cover-Berechnung zwischen Tokens (zum Debugging/Fehlerbeheben)."
            },
            "CreatureHeights": {
                "Name": "Standard-Kreaturenhöhen",
                "Hint": "Standard-Kreaturenhöhen (in Rastereinheiten) je Größenkategorie, die für die 3D-Deckungsberechnung verwendet werden. Wenn das Modul \"Wall Height\" aktiv ist, werden diese Vorgaben ignoriert und stattdessen die Höhen aus diesem Modul übernommen."
            },
            "HeightsMenu": {
                "Name": "Kreaturenhöhen",
                "Label": "Kreaturenhöhen konfigurieren",
                "Hint": "Passe die Standardhöhen (in Rastereinheiten) für jede Kreaturengröße an, die bei der Deckungsberechnung verwendet werden. Wenn das Modul \"Wall Height\" aktiv ist, werden diese Vorgaben ignoriert und stattdessen die Höhen aus diesem Modul übernommen.",
                "Legend": "Kreaturenhöhen",
                "BodyHint": "Lege die Standardhöhe (in Rastereinheiten) für jede Kreaturengröße fest. Diese Werte werden verwendet, wenn Tokens für Deckung als 3D-Prismen behandelt werden. Wenn das Modul \"Wall Height\" aktiv ist, werden diese Vorgaben ignoriert und stattdessen die Höhen aus diesem Modul übernommen.",
                "Buttons": {
                    "Save": "Speichern",
                    "Reset": "Zurücksetzen"
                }
            },
            "VariantMenu": {
                "Name": "Deckungs- & Messregeln",
                "Label": "Deckungs- & Messregeln konfigurieren",
                "Hint": "Lege fest, wie Simple Cover 5e Deckung berechnet und Entfernungen misst.",
                "Buttons": {
                    "Save": "Speichern"
                },
                "Groups": {
                    "General": "Deckungsregeln",
                    "Measurement": "Messregeln"
                }
            }
        },
        "Controls": {
            "ClearCover": {
                "Title": "Cover-Effekte entfernen"
            }
        }
    }
}